In [67]:
import pandas as pd

### 1. Athletes' data exploration

In [68]:
athletes = pd.read_excel("datasets/Athletes.xlsx")
athletes.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [69]:
athletes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11085 entries, 0 to 11084
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        11085 non-null  object
 1   NOC         11085 non-null  object
 2   Discipline  11085 non-null  object
dtypes: object(3)
memory usage: 259.9+ KB

In [70]:
athletes.isnull().sum()

Name          0
NOC           0
Discipline    0
dtype: int64

In [94]:
athletes.duplicated().sum()

1

In [95]:
athletes[ athletes.duplicated() ==True]

            Name      NOC Discipline
254  ALI Mohamed  Bahrain   Handball

In [98]:
athletes[ athletes.Name=="ALI Mohamed"]

            Name      NOC Discipline
253  ALI Mohamed  Bahrain   Handball
254  ALI Mohamed  Bahrain   Handball

In [99]:
athletes.drop_duplicates(inplace=True)
athletes[ athletes.Name=="ALI Mohamed"]

            Name      NOC Discipline
253  ALI Mohamed  Bahrain   Handball

In [71]:
athletes.describe()

             Name                       NOC Discipline
count       11085                     11085      11085
unique      11062                       206         46
top     CHEN Yang  United States of America  Athletics
freq            2                       615       2068

In [72]:
print(f"Nbres athletes: {len(set(athletes.Name))}")

Nbres athletes: 11062

In [73]:
print(f"Nbres pays: {len(set(athletes.NOC))}")

Nbres pays: 206

In [74]:
print(f"Nbres discipline: {len(set(athletes.Discipline))}")

Nbres discipline: 46

In [75]:
print(f"Liste des Disciplines:\n{set(athletes.Discipline)}")

Liste des Disciplines:
{'Sport Climbing', 'Modern Pentathlon', 'Equestrian', 'Beach Volleyball', 'Cycling BMX Racing', 'Baseball/Softball', 'Rhythmic Gymnastics', 'Fencing', 'Trampoline Gymnastics', 'Cycling Mountain Bike', 'Karate', 'Wrestling', 'Swimming', 'Cycling Track', 'Hockey', 'Rugby Sevens', 'Cycling BMX Freestyle', 'Judo', 'Tennis', 'Golf', 'Shooting', 'Football', 'Handball', 'Athletics', '3x3 Basketball', 'Taekwondo', 'Volleyball', 'Triathlon', 'Water Polo', 'Archery', 'Surfing', 'Canoe Sprint', 'Sailing', 'Canoe Slalom', 'Weightlifting', 'Table Tennis', 'Cycling Road', 'Basketball', 'Rowing', 'Badminton', 'Marathon Swimming', 'Artistic Gymnastics', 'Artistic Swimming', 'Diving', 'Skateboarding', 'Boxing'}

In [160]:
x = list(set(athletes.Discipline))

In [159]:
x[:10]

['Sport Climbing',
 'Modern Pentathlon',
 'Equestrian',
 'Beach Volleyball',
 'Cycling BMX Racing',
 'Baseball/Softball',
 'Rhythmic Gymnastics',
 'Fencing',
 'Trampoline Gymnastics',
 'Cycling Mountain Bike']

In [161]:
x[10:20]

['Karate',
 'Wrestling',
 'Swimming',
 'Cycling Track',
 'Hockey',
 'Rugby Sevens',
 'Cycling BMX Freestyle',
 'Judo',
 'Tennis',
 'Golf']

### 2. Coaches data exploration

In [76]:
coaches = pd.read_excel('datasets/Coaches.xlsx')
coaches.head()

c:\Users\LAB-MND\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

              Name            NOC  Discipline Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  Côte d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

In [77]:
coaches.shape

(394, 4)

In [78]:
coaches.describe()

                         Name    NOC  Discipline Event
count                     394    394         394   249
unique                    381     61           9     6
top     REQUENA PERICAS Judit  Japan  Basketball   Men
freq                        2     35          74    94

In [79]:
coaches.isnull().sum()

Name            0
NOC             0
Discipline      0
Event         145
dtype: int64

In [80]:
coaches.duplicated().sum()

1

In [81]:
coaches[ coaches.duplicated() == True]

                 Name     NOC         Discipline     Event
144  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

In [82]:
coaches[ coaches.Name == "GUERRERO Rolando"]

                 Name     NOC         Discipline     Event
143  GUERRERO Rolando  Mexico  Baseball/Softball  Softball
144  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

In [83]:
coaches.drop_duplicates(inplace=True)

In [84]:
coaches[ coaches.Name == "GUERRERO Rolando"]

                 Name     NOC         Discipline     Event
143  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

In [85]:
print(f"Nbre Coaches:{len(set(coaches.Name))}")

Nbre Coaches:381

In [86]:
print(f"Nbre Discipline coachées:{len(set(coaches.Discipline))}")

Nbre Discipline coachées:9

In [87]:
print("Les disciplines", set(coaches.Discipline))

Les disciplines {'Basketball', 'Handball', 'Hockey', 'Rugby Sevens', 'Volleyball', 'Artistic Swimming', 'Baseball/Softball', 'Water Polo', 'Football'}

In [88]:
set(coaches.Event)

{'Baseball', 'Duet', 'Men', 'Softball', 'Team', 'Women', nan}

### 3. EntriesGender' data exploration

In [89]:
gender = pd.read_excel('datasets/EntriesGender.xlsx')
gender.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [90]:
gender.shape

(46, 4)

In [100]:
gender.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [102]:
gender.duplicated().sum()

0

In [91]:
gender[['Female','Male']].sum()

Female    5432
Male      5884
dtype: int64

In [92]:
gender.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [93]:
gender.duplicated().sum()

0

### 4. Medals' data exploration

In [103]:
medals = pd.read_excel('datasets/Medals.xlsx')
medals.head()

c:\Users\LAB-MND\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
2,3,Japan,27,14,17,58,5
3,4,Great Britain,22,21,22,65,4
4,5,ROC,20,28,23,71,3

In [104]:
medals.shape

(93, 7)

In [106]:
medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           93 non-null     int64
 1   Team/NOC       93 non-null     object
 2   Gold           93 non-null     int64
 3   Silver         93 non-null     int64
 4   Bronze         93 non-null     int64
 5   Total          93 non-null     int64
 6   Rank by Total  93 non-null     int64
dtypes: int64(6), object(1)
memory usage: 5.2+ KB

In [127]:
medals = medals.sort_values(by="Rank by Total")
medals.head()

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
4,5,ROC,20,28,23,71,3
3,4,Great Britain,22,21,22,65,4
2,3,Japan,27,14,17,58,5

In [119]:
medals.isnull().sum()

Rank             0
Team/NOC         0
Gold             0
Silver           0
Bronze           0
Total            0
Rank by Total    0
dtype: int64

In [120]:
medals.duplicated().sum()

0

### 5. Teams data exploration

In [128]:
teams = pd.read_excel('datasets/Teams.xlsx')
teams.head()

      Name      Discipline                         NOC  Event
0  Belgium  3x3 Basketball                     Belgium    Men
1    China  3x3 Basketball  People's Republic of China    Men
2    China  3x3 Basketball  People's Republic of China  Women
3   France  3x3 Basketball                      France  Women
4    Italy  3x3 Basketball                       Italy  Women

In [129]:
teams.shape

(743, 4)

In [132]:
teams.isnull().sum()

Name          0
Discipline    0
NOC           0
Event         0
dtype: int64

In [133]:
teams.duplicated().sum()

0

In [134]:
teams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 743 entries, 0 to 742
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        743 non-null    object
 1   Discipline  743 non-null    object
 2   NOC         743 non-null    object
 3   Event       743 non-null    object
dtypes: object(4)
memory usage: 23.3+ KB

In [130]:
len(set(teams.Name))

146

In [136]:
len(set(teams.Discipline))

20

In [138]:
set(teams.Discipline)

{'3x3 Basketball',
 'Archery',
 'Artistic Gymnastics',
 'Artistic Swimming',
 'Athletics',
 'Baseball/Softball',
 'Basketball',
 'Beach Volleyball',
 'Cycling Track',
 'Fencing',
 'Football',
 'Handball',
 'Hockey',
 'Rhythmic Gymnastics',
 'Rugby Sevens',
 'Swimming',
 'Table Tennis',
 'Triathlon',
 'Volleyball',
 'Water Polo'}

In [139]:
athletes.columns

Index(['Name', 'NOC', 'Discipline'], dtype='object')

In [140]:
coaches.columns

Index(['Name', 'NOC', 'Discipline', 'Event'], dtype='object')

In [141]:
gender.columns

Index(['Discipline', 'Female', 'Male', 'Total'], dtype='object')

In [142]:
medals.columns

Index(['Rank', 'Team/NOC', 'Gold', 'Silver', 'Bronze', 'Total',
       'Rank by Total'],
      dtype='object')

In [168]:
set(teams.Discipline)

{'3x3 Basketball',
 'Archery',
 'Artistic Gymnastics',
 'Artistic Swimming',
 'Athletics',
 'Baseball/Softball',
 'Basketball',
 'Beach Volleyball',
 'Cycling Track',
 'Fencing',
 'Football',
 'Handball',
 'Hockey',
 'Rhythmic Gymnastics',
 'Rugby Sevens',
 'Swimming',
 'Table Tennis',
 'Triathlon',
 'Volleyball',
 'Water Polo'}

In [166]:
cpt = 0
for disc in x:
    if disc in list(coaches.Discipline.values):
        cpt +=1
print(cpt)

9

In [169]:
teams.columns

Index(['Name', 'Discipline', 'NOC', 'Event'], dtype='object')